{
    "model": {
        "class_name": "Sequential", 
        "keras_version": "2.2.4", 
        "config": {
            "layers": [
                {
                    "class_name": "Dense", 
                    "config": {
                        "kernel_initializer": {
                            "class_name": "VarianceScaling", 
                            "config": {
                                "distribution": "uniform", 
                                "scale": 1.0, 
                                "seed": null, 
                                "mode": "fan_avg"
                            }
                        }, 
                        "name": "dense_1", 
                        "kernel_constraint": null, 
                        "bias_regularizer": null, 
                        "bias_constraint": null, 
                        "dtype": "float32", 
                        "activation": "relu", 
                        "trainable": true, 
                        "kernel_regularizer": null, 
                        "bias_initializer": {
                            "class_name": "Zeros", 
                            "config": {}
                        }, 
                        "units": 100, 
                        "batch_input_shape": [
                            null, 
                            11
                        ], 
                        "use_bias": true, 
                        "activity_regularizer": null
                    }
                }, 
                {
                    "class_name": "Dense", 
                    "config": {
                        "kernel_initializer": {
                            "class_name": "VarianceScaling", 
                            "config": {
                                "distribution": "uniform", 
                                "scale": 1.0, 
                                "seed": null, 
                                "mode": "fan_avg"
                            }
                        }, 
                        "name": "dense_2", 
                        "kernel_constraint": null, 
                        "bias_regularizer": null, 
                        "bias_constraint": null, 
                        "activation": "relu", 
                        "trainable": true, 
                        "kernel_regularizer": null, 
                        "bias_initializer": {
                            "class_name": "Zeros", 
                            "config": {}
                        }, 
                        "units": 100, 
                        "use_bias": true, 
                        "activity_regularizer": null
                    }
                }, 
                {
                    "class_name": "Dense", 
                    "config": {
                        "kernel_initializer": {
                            "class_name": "VarianceScaling", 
                            "config": {
                                "distribution": "uniform", 
                                "scale": 1.0, 
                                "seed": null, 
                                "mode": "fan_avg"
                            }
                        }, 
                        "name": "dense_3", 
                        "kernel_constraint": null, 
                        "bias_regularizer": null, 
                        "bias_constraint": null, 
                        "activation": "relu", 
                        "trainable": true, 
                        "kernel_regularizer": null, 
                        "bias_initializer": {
                            "class_name": "Zeros", 
                            "config": {}
                        }, 
                        "units": 100, 
                        "use_bias": true, 
                        "activity_regularizer": null
                    }
                }, 
                {
                    "class_name": "Dense", 
                    "config": {
                        "kernel_initializer": {
                            "class_name": "VarianceScaling", 
                            "config": {
                                "distribution": "uniform", 
                                "scale": 1.0, 
                                "seed": null, 
                                "mode": "fan_avg"
                            }
                        }, 
                        "name": "dense_4", 
                        "kernel_constraint": null, 
                        "bias_regularizer": null, 
                        "bias_constraint": null, 
                        "activation": "relu", 
                        "trainable": true, 
                        "kernel_regularizer": null, 
                        "bias_initializer": {
                            "class_name": "Zeros", 
                            "config": {}
                        }, 
                        "units": 100, 
                        "use_bias": true, 
                        "activity_regularizer": null
                    }
                }, 
                {
                    "class_name": "Dense", 
                    "config": {
                        "kernel_initializer": {
                            "class_name": "VarianceScaling", 
                            "config": {
                                "distribution": "uniform", 
                                "scale": 1.0, 
                                "seed": null, 
                                "mode": "fan_avg"
                            }
                        }, 
                        "name": "dense_5", 
                        "kernel_constraint": null, 
                        "bias_regularizer": null, 
                        "bias_constraint": null, 
                        "activation": "relu", 
                        "trainable": true, 
                        "kernel_regularizer": null, 
                        "bias_initializer": {
                            "class_name": "Zeros", 
                            "config": {}
                        }, 
                        "units": 100, 
                        "use_bias": true, 
                        "activity_regularizer": null
                    }
                }, 
                {
                    "class_name": "Dropout", 
                    "config": {
                        "rate": 0.2, 
                        "noise_shape": null, 
                        "trainable": true, 
                        "seed": null, 
                        "name": "dropout_1"
                    }
                }, 
                {
                    "class_name": "Dense", 
                    "config": {
                        "kernel_initializer": {
                            "class_name": "VarianceScaling", 
                            "config": {
                                "distribution": "uniform", 
                                "scale": 1.0, 
                                "seed": null, 
                                "mode": "fan_avg"
                            }
                        }, 
                        "name": "dense_6", 
                        "kernel_constraint": null, 
                        "bias_regularizer": null, 
                        "bias_constraint": null, 
                        "activation": "softmax", 
                        "trainable": true, 
                        "kernel_regularizer": null, 
                        "bias_initializer": {
                            "class_name": "Zeros", 
                            "config": {}
                        }, 
                        "units": 2, 
                        "use_bias": true, 
                        "activity_regularizer": null
                    }
                }
            ], 
            "name": "sequential_1"
        }, 
        "backend": "theano"
    }, 
    "extra": {
        "inputs": [
            "jj_pt", 
            "ll_pt", 
            "ll_M", 
            "ll_DR_l_l", 
            "jj_DR_j_j", 
            "llmetjj_DPhi_ll_jj", 
            "llmetjj_minDR_l_j", 
            "llmetjj_MTformula", 
            "mt2", 
            "isSF", 
            "hme_h2mass_reco"
        ], 
        "cut": "91-ll_M>15 && hme_h2mass_reco>=250", 
        "masses": [
            400
        ], 
        "batch_size": 2000, 
        "epochs": 50, 
        "training_time": "0:29:20.356372", 
        "with_mass_column": false
    }
}